export const commentTexts = [
    "محصول عالی بود، کاملاً راضی هستم!",
    "کیفیت ساخت بسیار بالا، من خیلی خوشحالم که این رو خریدم.",
    "مورد پسند من نبود، متاسفانه برای من مناسب نبود.",
    "ارسال سریع بود و بسته بندی خوبی داشت.",
    "انتظارم از محصول بیشتر بود، اما در کل خوب بود.",
    "دقیقاً همون چیزی که نیاز داشتم.",
    "کاملاً برام مفید بود و راضی هستم.",
    "متاسفانه کالا با تصویر متفاوت بود.",
    "محصول خیلی باکیفیتی بود، حتماً دوباره میخرم.",
    "همه چیز عالی بود به جز کمی تاخیر در ارسال.",
    "قیمت مناسب و کیفیت خوب، توصیه می‌کنم.",
    "خریدم و هیچ مشکلی نداشتم، خیلی خوب بود.",
    "اصلاً فکر نمی‌کردم اینقدر راضی باشم.",
    "کاملاً با توضیحات مطابقت داشت.",
    "برای استفاده روزمره عالیه، ارزش خرید داره."
  ];
  