import Product1 from "../../assets/products/1.webp"; // ایمپورت تصویر محصول اول
import Product6 from "../../assets/products/6.webp"; // ایمپورت تصویر محصول دوم

export default function Compare(server, apiPrefix) {
  // ای‌پی‌آی برای مقایسه دو محصول
  server.post(`${apiPrefix}/compare`, (schema, { requestBody }) => {
    // ساخت داده‌های مقایسه
    let data = {
      title: [ // عنوان محصولات
        "گوشی موبایل اپل مدل پرومکس دو سیم‌ کارت نات اکتیو سیزده",
        "گوشی موبایل سامسونگ مدل Galaxy S24 Ultra دو سیم کارت ظرفیت 256 گیگابایت و رم 12 گیگابایت - ویتنام",
        "گوشی موبایل سامسونگ مدل Galaxy S24 Ultra دو سیم کارت ظرفیت 256 گیگابایت و رم 12 گیگابایت - ویتنام",

      ],
      slug: ["123", "456", "123"], // اسلاگ محصولات
      image: [Product1, Product6, Product1], // تصاویر محصولات
      rating: ["3", "5", "4"], // امتیاز محصولات
      price: [ // قیمت‌های محصولات
        {
          regularPrice: 21000000, // قیمت اصلی محصول اول
          discountedPrice: 19000000 // قیمت تخفیف‌خورده محصول اول
        },
        {
          regularPrice: 30000000, // قیمت اصلی محصول دوم
        },
        {
          regularPrice: 30000000, // قیمت اصلی محصول دوم
        },
      ],
      attributes: [ // ویژگی‌های محصولات
        {
          label: "رنگ ها", // عنوان ویژگی
          value: ["آبی ، قرمز ، مشکی", "مشکی"], // مقادیر ویژگی برای هر محصول
        },
        {
          label: "رنگ ها", // عنوان ویژگی
          value: ["آبی ، قرمز ، مشکی", "مشکی"], // مقادیر ویژگی برای هر محصول
        },
      ],
    };
    
    // برگرداندن داده‌های مقایسه
    return { message: "ok", data };
  });
}