// Function to retrieve the Persian message for a given HTTP code
const getHttpCodeMessage = (code) => {
    const httpCodes = {
      200: "عملیات با موفقیت انجام شد.",
      201: "مورد با موفقیت ایجاد شد.",
      202: "درخواست پذیرفته شد، اما هنوز پردازش نشده است.",
      204: "هیچ محتوایی برای بازگشت وجود ندارد.",
      400: "درخواست نامعتبر است.",
      401: "دسترسی غیرمجاز! لطفاً وارد حساب خود شوید.",
      403: "شما مجاز به انجام این عملیات نیستید.",
      404: "مورد یافت نشد.",
      405: "روش درخواست مجاز نیست.",
      406: "محتوا مناسب درخواست نیست.",
      408: "درخواست شما با زمان تایم‌اوت مواجه شد.",
      409: "تداخل در درخواست! مورد تکراری است.",
      410: "مورد به طور دائم حذف شده است.",
      411: "درخواست نیاز به طول محتوا دارد.",
      412: "پیش‌نیازهای شرایطی برآورده نشده است.",
      413: "حجم درخواست بسیار زیاد است.",
      414: "آدرس URL درخواست خیلی طولانی است.",
      415: "فرمت محتوای درخواست پشتیبانی نمی‌شود.",
      416: "محدوده درخواست نامعتبر است.",
      417: "انتظارات درخواست برآورده نشد.",
      422: "خطای اعتبارسنجی داده‌ها.",
      429: "بیش از حد مجاز درخواست ارسال شده است.",
      500: "خطای داخلی سرور! لطفاً بعداً تلاش کنید.",
      501: "ویژگی مورد نظر پشتیبانی نمی‌شود.",
      502: "مشکلی در ارتباط با سرور پیش آمده است.",
      503: "سرویس در دسترس نیست! لطفاً بعداً امتحان کنید.",
      504: "زمان تایم‌اوت گیت‌وی سرور تمام شد.",
      505: "نسخه HTTP پشتیبانی نمی‌شود.",
    };
  
    // Return the Persian message, or a default error message if the code is not found
    return httpCodes[code] || "خطای نامشخص رخ داده است.";
  };
  
  export default getHttpCodeMessage;
  